[
  {
    "id": 1,
    "title": "For Forgiveness",
    "arabic": " رَبِّ إِنِّى ظَلَمْتُ نَفْسِى فَٱغْفِرْ لِى",
    "urdu": " اے پروردگار میں نے اپنے آپ پر ظلم کیا تو مجھے بخش دے",
    "english": "My Lord! I have definitely wronged my soul, so forgive me."
  },
  {
    "id": 2,
    "title": "To be grateful",
    "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "urdu": "",
    "english": "O Allah, help me remember You, to be grateful to You, and to worship You in an excellent manner."
  },
  {
    "id": 3,
    "title": "For Righteous Offspring",
    "arabic": " رَبِّ هَبْ لِى مِنَ ٱلصَّـٰلِحِينَ",
    "urdu": "اے پروردگار مجھے (اولاد) عطا فرما (جو) سعادت مندوں میں سے (ہو)",
    "english": "My Lord! Bless me with righteous offspring."
  },
  {
    "id": 4,
    "title": "Change our heart to obedience",
    "arabic": "اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ ",
    "urdu": "",
    "english": "O Allah! Controller of the hearts, direct our hearts to Your obedience."
  },
  {
    "id": 5,
    "title": "Dua of Nuh (A.S)",
    "arabic": "  رَبِّ إِنِّىٓ أَعُوذُ بِكَ أَنْ أَسْـَٔلَكَ مَا لَيْسَ لِى بِهِۦ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِى وَتَرْحَمْنِىٓ أَكُن مِّنَ ٱلْخَـٰسِرِينَ",
    "urdu": " پروردگار میں تجھ سے پناہ مانگتا ہوں کہ ایسی چیز کا تجھ سے سوال کروں جس کی حقیقت مجھے معلوم نہیں۔ اور اگر تو مجھے نہیں بخشے گا اور مجھ پر رحم نہیں کرے گا تو میں تباہ ہوجاؤں گا",
    "english": "My Lord, I seek refuge in You from asking You about what I have no knowledge of, and unless You forgive me and have mercy on me, I will be one of the losers."
  },
  {
    "id": 6,
    "title": "Dua of Yunus (A.S)",
    "arabic": "لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبْحَٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّٰلِمِينَ",
    "urdu": "'تیرے سوا کوئی معبود برحق نہیں، پاک ہے تو، بیشک میں ہی ظالموں میں سے ہوں۔'",
    "english": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers."
  },
  {
    "id": 7,
    "title": "Dua of Lut (A.S)",
    "arabic": " رَبِّ ٱنصُرْنِى عَلَى ٱلْقَوْمِ ٱلْمُفْسِدِينَ",
    "urdu": " کہ اے میرے پروردگار ان مفسد لوگوں کے مقابلے میں مجھے نصرت عنایت فرما",
    "english": "My Lord! Help me against the people of corruption."
  },
  {
    "id": 8,
    "title": "Have Mercy on Us",
    "arabic": " أَنتَ وَلِيُّنَا فَٱغْفِرْ لَنَا وَٱرْحَمْنَا ۖ وَأَنتَ خَيْرُ ٱلْغَـٰفِرِينَ",
    "urdu": "تو ہی ہمارا کارساز ہے تو ہمیں (ہمارے گناہ) بخش دے اور ہم پر رحم فرما اور تو سب سے بہتر بخشنے والا ہے",
    "english": "You are our Guardian. So forgive us and have mercy on us. You are the best forgiver."
  },
  {
    "id": 9,
    "title": "For Sins and Debts",
    "arabic": " اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
    "urdu": "",
    "english": "O Allah, I seek refuge with You from sin and debt."
  },
  {
    "id": 10,
    "title": "Seek Refuge from Punishments",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ  وَأَعُوذُ بِكَ مِنْ فِتْـنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْـنَةِ الْمَحْيَا وَالْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
    "urdu": "",
    "english": "O Allah, I seek refuge with You from the punishment of the grave, and I seek refuge with You from the temptation and trial of Al-Maseeh Ad-Dajjal (the Antichrist), and I seek refuge with You from the trials and tribulations of life and death. O Allah, I seek refuge with You from sin and debt."
  },
  {
    "id": 11,
    "title": "Give us Good in both worlds",
    "arabic": "رَبَّنَا آتِنَا فِىْ الدُّنْيَا حَسَنَةً وَفِىْ الآخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ  ",
    "urdu": "اے ہمارے رب! ہمیں دنیا میں بھی بھلائی دے اور آخرت میں بھی بھلائی عطا فرما اور ہمیں آگ کے عذاب سے بچا۔",
    "english": "Our Lord! Give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire. "
  },
  {
    "id": 12,
    "title": "Dua of Musa (A.S)",
    "arabic": "رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍۢ فَقِيرٌۭ ",
    "urdu": "پروردگار میں اس کا محتاج ہوں کہ تو مجھ پر اپنی نعمت نازل فرمائے",
    "english": "My Lord, indeed I am, for whatever good You would send down to me, in need."
  },
  {
    "id": 13,
    "title": "For Forgiveness",
    "arabic": "أسْتَغْفِرُ اللهَ الَّذِي لا إلَهَ إلا هُوَ الحَيُّ القَيُومُ وَأتُوبُ إلَيهِ  ",
    "urdu": "",
    "english": "I seek the forgiveness of Allah, there is no true god except Allah, the Ever-Living, the Self-Subsisting, and I turn to Him in repentance "
  },
  {
    "id": 14,
    "title": "For Halal Rizq",
    "arabic": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ  ",
    "urdu": "اے اللہ ! میری کفایت کر اپنی حلال کردہ کے ساتھ، اپنے حرام کردہ سے( بچا کر) میری کفایت کر اور مجھے اپنے فضل سے اپنے سوا ہر کسی سے بے پروا کر دے۔ ",
    "english": "O Allah! Make sufficient for me what is halal (lawful) and keep me away from what is haram (unlawful) and enrich me with Your Favours so that I am dependent upon no one but You. "
  },
  {
    "id": 15,
    "title": "Make things Easy",
    "arabic": "رَبِِّي يَسِِّرْ وَلاَ تُعَسِِّرْ وَتَمِِّمْ بِالخير",
    "urdu": "",
    "english": "Oh Allah, make this task easy and do not make it difficult. Oh, Allah! Make it end well."
  },
  {
    "id": 16,
    "title": "Protection from Hell-fire",
    "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ ",
    "urdu": "",
    "english": "O Allah, save me from the fire (Jahannam)"
  },
  {
    "id": 17,
    "title": "Dua for protection from diseases",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئِ الأَسْقَامِ",
    "urdu": "اے اللہ! بے شک میں پناہ مانگتا ہوں تجھ سے پھل بہری اور پاگل پن اور کوڑھ اور انتہائی مہلک بیماریوں سے۔",
    "english": "O Allah! I seek refuge in You from albinism, insanity, leprosy and from evil diseases."
  },
  {
    "id": 18,
    "title": "Protection from Evil",
    "arabic": "للَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي وَمِنْ شَرِّ بَصَرِي وَمِنْ شَرِّ لِسَانِي وَمِنْ شَرِّ قَلْبِي وَمِنْ شَرِّ مَنِيِّي ",
    "urdu": "",
    "english": "O Allah, I seek refuge in You from the evil of my hearing, and from the evil of my sight, and from the evil of my tongue, and from the evil of my heart and from the evil of my issue."
  },
  {
    "id": 19,
    "title": "Praise to be Allah SWT",
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "urdu": "",
    "english": "Glory be to Allah, Praise be to Allah, There is no God but Allah, Allah is Great, There is no Support and No Power except in Allah."
  },

  {
    "id": 20,
    "title": "Dua for Protection",
    "arabic": "اَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ    ",
    "urdu": "",
    "english": "I seek refuge in the perfect words of Allaah, from every devil and every poisonous reptile, and from every bad eye."
  },

  {
    "id": 21,
    "title": "For Patience",
    "arabic": " رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
    "urdu": "اے پروردگار ہم پر صبرواستقامت کے دہانے کھول دے اور ہمیں (ماریو تو) مسلمان ہی ماریو",
    "english": "Our Lord! Shower us with perseverance, and let us die while submitting ˹to You˺."
  },

  {
    "id": 22,
    "title": "Protection from Jahannam",
    "arabic": " رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ",
    "urdu": "اے پروردگار ہم ایمان لے آئے سو ہم کو ہمارے گناہ معاف فرما اور دوزخ کے عذاب سے محفوظ رکھ",
    "english": "Our Lord! We have believed, so forgive our sins and protect us from the torment of the Fire."
  },

  {
    "id": 23,
    "title": "For Protection",
    "arabic": "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "urdu": "",
    "english": "In the name of Allah with Whose Name nothing on earth or in heaven harms and He is the All-Hearing the All-Knowing and is then harmed by anything."
  },
  {
    "id": 24,
    "title": "Dua for Jannah",
    "arabic": "اللهم اِنّي أَسْئَلُكَ الجَنّةُ الفِردَوْس وأعُوْذْوبِكَ مِنَ النَّار    ",
    "urdu": "",
    "english": "O Allah I ask you for gardens of firdous and I seek refuge from the fire"
  },
  {
    "id": 25,
    "title": "Wronged ourselves",
    "arabic": " رَبَّنَا ظَلَمْنَآ أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ ٱلْخَـٰسِرِينَ",
    "urdu": " پروردگار ہم نے اپنی جانوں پر ظلم کیا اور اگر تو ہمیں نہیں بخشے گا اور ہم پر رحم نہیں کرے گا تو ہم تباہ ہو جائیں گے",
    "english": "Our Lord! We have wronged ourselves. If You do not forgive us and have mercy on us, we will certainly be losers."
  },
  {
    "id": 26,
    "title": "Dua for Nafs",
    "arabic": "أَللّٰهُمَّ اٰتِ نَفْسِىْ تَقْوَاهَا وَ زَكِّهَا اَنْتَ خَيْرُ مَنْ زَكَّاهَا اَنْتَ وَلِيُّهَا وَ مَوْلَاهَا",
    "urdu": "اے اللہ ! میرے نفس کو اس کا تقوی عطا کر اور اسکو پاک رکھ، تو ہی اس کو بہترین پاک کرنے والا ہے، تو ہی اس کا ولی اور مولا ہے۔",
    "english": "O Allah! Grant piety to my soul (nafs) and purify it, You are the Best of the ones to purify it; You are its Guardian and Patron."
  },
  {
    "id": 27,
    "title": "Dua for Rizq",
    "arabic": " اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
    "urdu": "",
    "english": "O Allah, I ask You for beneficial knowledge, goodly provision, and acceptable deeds."
  },
  {
    "id": 28,
    "title": "Dua for Parents",
    "arabic": " رَّبِّ ٱرْحَمْهُمَا كَمَا رَبَّيَانِى صَغِيرًا",
    "urdu": "اے میرے رب ان دونوں پر رحم فرما جیسے کہ انہوں نے مجھے بچپن میں پالا",
    "english": "My Lord! Be merciful to them as they raised me when I was young."
  }
]
