[
  {
    "id": 1,
    "title": "Afraid",
    "sub_title": "Strengthen Heart",
    "arabic": "وَلَنَبْلُوَنَّكُم بِشَىْءٍ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ ٱلَّذِينَ إِذَآ أَصَـٰبَتْهُم مُّصِيبَةٌ قَالُوٓا إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَٰجِعُونَ",
    "urdu_translation": "اور ہم کسی نہ کسی طرح تمہاری آزمائش ضرور کریں گے، دشمن کے ڈر سے، بھوک پیاس سے، مال وجان اور پھلوں کی کمی سے اور ان صبر کرنے والوں کو خوشخبری دے دیجیئے۔ جنہیں، جب کبھی کوئی مصیبت آتی ہے تو کہہ دیا کرتے ہیں کہ ہم تو خود اللہ تعالیٰ کی ملکیت ہیں اور ہم اسی کی طرف لوٹنے والے ہیں۔",
    "english_translation": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient, Who, when disaster strikes them, say, 'Indeed we belong to Allah, and indeed to Him we will return.'",
    "reference": "2:155"
  },
  {
    "id": 2,
    "title": "Angry",
    "sub_title": "Extinguish",
    "arabic": "ٱلَّذِينَ يُنفِقُونَ فِى ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلْكَـٰظِمِينَ ٱلْغَيْظَ وَٱلْعَافِينَ عَنِ ٱلنَّاسِ ۗ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
    "urdu_translation": "جو آسودگی اور تنگی میں (اپنا مال خدا کی راہ میں) خرچ کرتےہیں اور غصے کو روکتے اور لوگوں کے قصور معاف کرتے ہیں اور خدا نیکو کاروں کو دوست رکھتا ہے",
    "english_translation": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good",
    "reference": "3:134"
  },
  {
    "id": 3,
    "title": "Anxious",
    "sub_title": "Windex for Negativity",
    "arabic": "وَإِذْ يَمْكُرُ بِكَ ٱلَّذِينَ كَفَرُو لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ ٱللَّهُ ۖ وَٱللَّهُ خَيْرُ ٱلْمَـٰكِرِينَ",
    "urdu_translation": "اور اس واقعہ کا بھی ذکر کیجئے! جب کہ کافر لوگ آپ کی نسبت تدبیر سوچ رہے تھے کہ آپ کو قید کر لیں، یا آپ کو قتل کر ڈالیں یا آپ کو خارج وطن کر دیں اور وه تو اپنی تدبیریں کر رہے تھے اور اللہ اپنی تدبیر کر رہا تھا اور سب سے زیاده مستحکم تدبیر واﻻ اللہ ہے",
    "english_translation": "And [remember, O Muḥammad], when those who disbelieved plotted against you to restrain you or kill you or evict you [from Makkah]. But they plan, and Allah plans. And Allah is the best of planners.",
    "reference": "8:30"
  },
  {
    "id": 4,
    "title": "Treated-harshly",
    "sub_title": "Energy Drink for You",
    "arabic": "وَعِبَادُ ٱلرَّحْمَـٰنِ ٱلَّذِينَ يَمْشُونَ عَلَى ٱلْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ ٱلْجَـٰهِلُونَ قَالُو سَلَـٰمًا",
    "urdu_translation": "رحمٰن کے (سچے) بندے وه ہیں جو زمین پر فروتنی کے ساتھ چلتے ہیں اور جب بے علم لوگ ان سے باتیں کرنے لگتے ہیں تو وه کہہ دیتے ہیں کہ سلام ہے",
    "english_translation": "And the servants of the Most Merciful are those who walk upon the earth easily, and when the ignorant address them [harshly], they say [words of] peace",
    "reference": "25:63"
  },
  {
    "id": 5,
    "title": "Depressed",
    "sub_title": "Productivity Energy Drink",
    "arabic": "َلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
    "urdu_translation": "تم نہ سستی کرو اور غمگین ہو، تم ہی غالب رہو گے، اگر تم ایماندار ہو",
    "english_translation": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
    "reference": "3:139"
  },
  {
    "id": 6,
    "title": "Burdened",
    "sub_title": "Lightens you",
    "arabic": "لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ",
    "urdu_translation": "اللہ تعالیٰ کسی جان کو اس کی طاقت سے زیاده تکلیف نہیں دیتا",
    "english_translation": "Allah does not charge a soul except [with that within] its capacity.",
    "reference": "2:286"
  },
  {
    "id": 7,
    "title": "Loser",
    "sub_title": "Makes you stronger",
    "arabic": "مَاۤ اَصَابَ مِنۡ مُّصِيۡبَةٍ اِلَّا بِاِذۡنِ اللّٰهِ ؕ وَمَنۡ يُّؤۡمِنۡۢ بِاللّٰهِ يَهۡدِ قَلۡبَهٗ ؕ وَاللّٰهُ بِكُلِّ شَىۡءٍ عَلِيۡمٌ",
    "urdu_translation": "کوئی مصیبت اللہ کی اجازت کے بغیر نہیں پہنچ سکتی، جو اللہ پر ایمان ﻻئے اللہ اس کے دل کو ہدایت دیتا ہے اور اللہ ہر چیز کو خوب جاننے واﻻ ہے",
    "english_translation": "No misfortune ever befalls except by permission of Allah. And whoever has faith in Allah - He will guide his heart. And Allah is Knowing of all things",
    "reference": "64:11"
  },
  {
    "id": 8,
    "title": "Lonely",
    "sub_title": "Accompanies you",
    "arabic": "قَالَ لَا تَخَافَآ ۖ إِنَّنِى مَعَكُمَآ أَسْمَعُ وَأَرَىٰ",
    "urdu_translation": "جواب ملا کہ تم مطلقاً خوف نہ کرو میں تمہارے ساتھ ہوں اور سنتا دیکھتا رہوں گا",
    "english_translation": "[Allah] said, Fear not. Indeed, I am with you both; I hear and I see.",
    "reference": "20:46"
  },
  {
    "id": 9,
    "title": "Proud",
    "sub_title": "Reminds you of your deeds",
    "arabic": "وَلَا تَمْشِ فِى ٱلْأَرْضِ مَرَحًا ۖ إِنَّكَ لَن تَخْرِقَ ٱلْأَرْضَ وَلَن تَبْلُغَ ٱلْجِبَالَ طُولًا",
    "urdu_translation": "اور زمین میں اکڑ کر نہ چل کہ نہ تو زمین کو پھاڑ سکتا ہے اور نہ لمبائی میں پہاڑوں کو پہنچ سکتا ہے.",
    "english_translation": "And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height",
    "reference": "17:37"
  },
  {
    "id": 10,
    "title": "Underpriviledged",
    "sub_title": "Makes you Thankful",
    "arabic": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِن تَعُدُّو نِعْمَتَ ٱللَّهِ لَا تُحْصُوهَآ ۗ إِنَّ ٱلْإِنسَـٰنَ لَظَلُومٌ كَفَّارٌ",
    "urdu_translation": "اسی نے تمہیں تمہاری منہ مانگی کل چیزوں میں سے دے رکھا ہے۔ اگر تم اللہ کے احسان گننا چاہو تو انہیں پورے گن بھی نہیں سکتے۔ یقیناً انسان بڑا ہی بے انصاف اور ناشکرا ہے",
    "english_translation": "And He gave you from all you asked of Him. And if you should count the favor [i.e., blessings] of Allah, you could not enumerate them. Indeed, mankind is [generally] most unjust and ungrateful.",
    "reference": "14:34"
  },
  {
    "id": 11,
    "title": "Weak",
    "sub_title": "Comforts you",
    "arabic": "ُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمْ ۚ وَخُلِقَ ٱلْإِنسَـٰنُ ضَعِيفًا",
    "urdu_translation": "اللہ چاہتا ہے کہ تم سے تخفیف کر دے کیونکہ انسان کمزور پیدا کیا گیا ہے۔",
    "english_translation": "And Allah wants to lighten for you [your difficulties]; and mankind was created weak.",
    "reference": "4:28"
  },
  {
    "id": 12,
    "title": "Upset",
    "sub_title": "Allah is the Greatest",
    "arabic": "إِن يَنصُرْكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِن يَخْذُلْكُمْ فَمَن ذَا ٱلَّذِى يَنصُرُكُم مِّنۢ بَعْدِهِۦ ۗ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
    "urdu_translation": "اگر اللہ تعالیٰ تمہاری مدد کرے تو تم پر کوئی غالب نہیں آسکتا اور اگر وہ تمہیں چھوڑ دے تو اس کے بعد کون ہے جو تمہاری مدد کرے؟ ایمان والوں کو اللہ تعالیٰ ہی پر بھروسہ رکھنا چاہئے",
    "english_translation": "If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him? And upon Allah let the believers rely",
    "reference": "3:160"
  },
  {
    "id": 13,
    "title": "Danger",
    "sub_title": "Reminds you of Allah's Protection",
    "arabic": "وَمَكَرُوا وَمَكَرَ ٱللَّهُ ۖ وَٱللَّهُ خَيْرُ ٱلْمَـٰكِرِينَ",
    "urdu_translation": "اور کافروں نے مکر کیا اور اللہ تعالیٰ نے بھی (مکر) خفیہ تدبیر کی اور اللہ تعالیٰ سب خفیہ تدبیر کرنے والوں سے بہتر ہے",
    "english_translation": "And they [i.e., the disbelievers] planned, but Allah planned. And Allah is the best of planners.",
    "reference": "3:54"
  },
  {
    "id": 14,
    "title": "Desire",
    "sub_title": "Helps you with your desires",
    "arabic": "وَمَنْ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيْرِ هُدًى مِّنَ ٱللَّهِ ۚ إِنَّ ٱللَّهَ لَا يَهْدِى ٱلْقَوْمَ ٱلظَّـٰلِمِينَ",
    "urdu_translation": "اور اس سے زیادہ کون گمراہ ہوگا جو خدا کی ہدایت کو چھوڑ کر اپنی خواہش کے پیچھے چلے۔ بیشک خدا ظالم لوگوں کو ہدایت نہیں دیتا",
    "english_translation": "And who is more astray than one who follows his desire without guidance from Allah? Indeed, Allah does not guide the wrongdoing people.",
    "reference": "28:50"
  },
  {
    "id": 15,
    "title": "Lack-of-faith",
    "sub_title": "Allah's remembrance can only help you",
    "arabic": "ٱلَّذِينَ ءَامَنُو وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ ٱللَّهِ ۗ أَلَا بِذِكْرِ ٱللَّهِ تَطْمَئِنُّ ٱلْقُلُوبُ",
    "urdu_translation": "جو لوگ ایمان ﻻئے ان کے دل اللہ کے ذکر سے اطمینان حاصل کرتے ہیں۔ یاد رکھو اللہ کے ذکر سے ہی دلوں کو تسلی حاصل ہوتی ہے",
    "english_translation": "Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured",
    "reference": "13:28"
  },
  {
    "id": 16,
    "title": "Courage",
    "sub_title": "Be Courageous",
    "arabic": "هَلْ جَزَآءُ ٱلْإِحْسَـٰنِ إِلَّا ٱلْإِحْسَـٰنُ",
    "urdu_translation": "احسان کا بدلہ احسان کے سوا کیا ہے",
    "english_translation": "Is the reward for good [anything] but good?",
    "reference": "55:60"
  },
  {
    "id": 17,
    "title": "Not-appreciated",
    "sub_title": "Be patient",
    "arabic": "إِنَّ هَـٰذَا كَانَ لَكُمْ جَزَآءً وَكَانَ سَعْيُكُم مَّشْكُورًا",
    "urdu_translation": "کہا جائے گا کہ یہ ہے تمہارے اعمال کا بدلہ اور تمہاری کوشش کی قدر کی گئی",
    "english_translation": "[And it will be said], Indeed, this is for you a reward, and your effort has been appreciated.",
    "reference": "76:22"
  },
  {
    "id": 18,
    "title": "Direction",
    "sub_title": "Don't lose hope",
    "arabic": "مَآ أَصَابَ مِن مُّصِيبَةٍ إِلَّا بِإِذْنِ ٱللَّهِ ۗ وَمَن يُؤْمِنۢ بِٱللَّهِ يَهْدِ قَلْبَهُۥ ۚ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌ",
    "urdu_translation": "کوئی مصیبت اللہ کی اجازت کے بغیر نہیں پہنچ سکتی، جو اللہ پر ایمان ﻻئے اللہ اس کے دل کو ہدایت دیتا ہے اور اللہ ہر چیز کو خوب جاننے واﻻ ہے",
    "english_translation": "No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things.",
    "reference": "64:11"
  },
  {
    "id": 19,
    "title": "Overwhelmed-with-hardships",
    "sub_title": "Good days are coming",
    "arabic": "فَإِنَّ مَعَ ٱلْعُسْرِ يُسْرًا",
    "urdu_translation": "پس یقیناً مشکل کے ساتھ آسانی ہے",
    "english_translation": "For indeed, with hardship [will be] ease [i.e., relief]",
    "reference": "94:5"
  },
  {
    "id": 20,
    "title": "Lost-hope",
    "sub_title": "Gives you Hope",
    "arabic": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍ قَدْرًا",
    "urdu_translation": " اور اسے ایسی جگہ سے روزی دیتا ہے جس کا اسے گمان بھی نہ ہو اور جو شخص اللہ پر توکل کرے گا اللہ اسے کافی ہوگا۔ اللہ تعالیٰ اپنا کام پورا کرکے ہی رہے گا۔ اللہ تعالیٰ نے ہر چیز کا ایک اندازه مقرر کر رکھا ہے",
    "english_translation": "And will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.",
    "reference": "65:3"
  },
  {
    "id": 21,
    "title": "Love-and-tranquility",
    "sub_title": "Repent and Allah will forgive you",
    "arabic": "إِنَّ اللَّـهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ",
    "urdu_translation": "کچھ شک نہیں کہ خدا توبہ کرنے والوں اور پاک صاف رہنے والوں کو دوست رکھتا ہے",
    "english_translation": "Indeed, Allah loves those who are constantly repentant and loves those who purify themselves.",
    "reference": "2:222"
  },
  {
    "id": 22,
    "title": "Seeking-peace",
    "sub_title": "Patience, patience, and patience",
    "arabic": "وَبَشِّرِ ٱلصَّـٰبِرِينَ ٱلَّذِينَ إِذَآ أَصَـٰبَتْهُم مُّصِيبَةٌ قَالُوٓا إِنَّا لِلَّهِ وَإِنَّآ إِلَيْهِ رَٰجِعُونَ",
    "urdu_translation": "اور ان صبر کرنے والوں کو خوشخبری دے دیجیئے۔ جنہیں، جب کبھی کوئی مصیبت آتی ہے تو کہہ دیا کرتے ہیں کہ ہم تو خود اللہ تعالیٰ کی ملکیت ہیں اور ہم اسی کی طرف لوٹنے والے ہیں",
    "english_translation": "but give good tidings to the patient, Who, when disaster strikes them, say, 'Indeed we belong to Allah, and indeed to Him we will return.'",
    "reference": "2:155"
  },
  {
    "id": 23,
    "title": "Seeking-patience",
    "sub_title": "Patience, patience, and patience",
    "arabic": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا ٱسْتَعِينُوا بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ",
    "urdu_translation": "اے ایمان والو! صبر اور نماز کے ذریعہ مدد چاہو، اللہ تعالی صبر والوں کا ساتھ دیتا ہے۔",
    "english_translation": "O you who have believed, seek help through patience and prayer. Indeed, Allah is with the patient.",
    "reference": "2:153"
  },
  {
    "id": 24,
    "title": "Stay-steadfast",
    "sub_title": "You'll be rewarded",
    "arabic": "مَن كَانَ يُرِيدُ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَـٰلَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ",
    "urdu_translation": "جو شخص دنیا کی زندگی اور اس کی زینت پر فریفتہ ہوا چاہتا ہو ہم ایسوں کو ان کے کل اعمال (کا بدلہ) یہی بھرپور پہنچا دیتے ہیں اور یہاں انہیں کوئی کمی نہیں کی جاتی",
    "english_translation": "Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived.",
    "reference": "11:15"
  },
  {
    "id": 25,
    "title": "Hard-on-myself",
    "sub_title": "Be amongst the steadfast",
    "arabic": "أَحَسِبَ ٱلنَّاسُ أَن يُتْرَكُوٓا أَن يَقُولُوٓا ءَامَنَّا وَهُمْ لَا يُفْتَنُونَ",
    "urdu_translation": "کیا لوگوں نے یہ گمان کر رکھا ہے کہ ان کے صرف اس دعوے پر کہ ہم ایمان ﻻئے ہیں ہم انہیں بغیر آزمائے ہوئے ہی چھوڑ دیں گے؟.",
    "english_translation": "Do the people think that they will be left to say, 'We believe' and they will not be tried?",
    "reference": "29:2"
  },
  {
    "id": 26,
    "title": "Unhappy",
    "sub_title": "Patience is the key to success",
    "arabic": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
    "urdu_translation": "تم نہ سستی کرو اور غمگین ہو، تم ہی غالب رہو گے، اگر تم ایماندار ہو",
    "english_translation": "So do not weaken and do not grieve, and you will be superior if you are [true] believers",
    "reference": "3:139"
  },
  {
    "id": 27,
    "title": "Wishing-friend",
    "sub_title": "Allah's with you",
    "arabic": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَـٰنَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِۦ نَفْسُهُۥ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ",
    "urdu_translation": "ہم نے انسان کو پیدا کیا ہے اور اس کے دل میں جو خیاﻻت اٹھتے ہیں ان سے ہم واقف ہیں اور ہم اس کی رگ جان سے بھی زیاده اس سے قریب ہیں",
    "english_translation": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein",
    "reference": "50:16"
  }
]
